app/Controllers/anggota.php

SELECT *
FROM `anggota`
 LIMIT 24, 6
SELECT COUNT(*) AS `numrows`
FROM `anggota`
---
    public function index()
    {
        $currentPage = $this->request->getVar('page_anggota') ?? 1;
        $keyword = $this->request->getVar('keyword');

        if ($keyword) {
            $anggota = $this->AnggotaModel->search($keyword);
        } else {
            $anggota = $this->AnggotaModel;
        }

        $data = [
            'title' => 'Daftar Anggota',
            'anggota' => $this->AnggotaModel->paginate(6, 'anggota'),