app/Controllers/Buku.php

    public function simpan()
    {

        $this->BukuModel->save([
            'judul' => $this->request->getVar('judul'),
            'pengarang' => $this->request->getVar('pengarang'),
            'penerbit' => $this->request->getVar('penerbit'),
            'tahun_terbit' => $this->request->getVar('tahun_terbit'),
            'sampul' => $this->request->getVar('sampul'),

        ]);
---
INSERT INTO `buku` (`judul`, `pengarang`, `penerbit`, `tahun_terbit`, `sampul`) VALUES ('Self Healing With Quran', 'lbnu Syuhada', 'Elex Media Komputindo', '2023', '5.jpg')

        public function update($id_buku)
        {
            $fileSampul = $this->request->getFile('sampul');

            // Check if a new image was uploaded
            if ($fileSampul->getError() == 4) {
                $namaSampul = $this->request->getVar('sampulLama');
            } else {
                // Generate a new image name
                $namaSampul = $fileSampul->getRandomName();

                // Move the new image to the 'img' folder
                $fileSampul->move('img', $namaSampul);

                // Check if the old image file exists before attempting to delete it
                $oldImageFilePath = 'img/' . $this->request->getVar('sampulLama');
                if (is_file($oldImageFilePath)) {
                    unlink($oldImageFilePath); // Delete the old image
                }
            }

            $this->BukuModel->update($id_buku, [
                'judul' => $this->request->getVar('judul'),
                'pengarang' => $this->request->getVar('pengarang'),
                'penerbit' => $this->request->getVar('penerbit'),
                'tahun_terbit' => $this->request->getVar('tahun_terbit'),
                'sampul' => $namaSampul,
            ]);
---
UPDATE `buku` SET `judul` = 'Tuhan, Beri Aku Alasan untuk Tidak Menyerah', `pengarang` = ' Ummu Kalsum Iqt', `penerbit` = 'Syalmahat Publishing', `tahun_terbit` = '2005', `sampul` = '1700091775_808badd2666e5653d594.jpg'
WHERE `buku`.`id_buku` IN ('3')